{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from rdflib import Graph, Namespace, Literal, URIRef"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_movies_directors_in(sparql_endpoint, director_name):\n",
    "    # Define the DBpedia SPARQL endpoint\n",
    "    sparql_endpoint = sparql_endpoint\n",
    "    director_name = director_name\n",
    "\n",
    "\n",
    "    # Define the SPARQL query to retrieve movies\n",
    "    sparql_query = \"\"\"\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "\n",
    "    SELECT ?movie ?title ?director\n",
    "    WHERE {{\n",
    "        ?movie rdf:type dbo:Film;\n",
    "            rdfs:label ?title;\n",
    "            dbo:director ?d.\n",
    "        ?d rdfs:label ?director.\n",
    "        FILTER(?director = \"{}\"@en)\n",
    "        FILTER(LANG(?title)=\"en\")\n",
    "    }}\n",
    "    LIMIT 100\n",
    "    \"\"\".format(director_name)\n",
    "\n",
    "    # Send the SPARQL query to the DBpedia SPARQL endpoint\n",
    "    response = requests.get(sparql_endpoint, params={'query': sparql_query, 'format': 'json'})\n",
    "    data = response.json()\n",
    "\n",
    "    # Parse the JSON response and create an rdflib graph\n",
    "    graph = Graph()\n",
    "    graph.parse(data=response.text, format=\"json-ld\")\n",
    "\n",
    "    # Iterate over the results and print movie titles\n",
    "    for result in data['results']['bindings']:\n",
    "        title = result['title']['value']\n",
    "        print(title)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Quay (film)\n",
      "Batman Begins\n",
      "Memento (film)\n",
      "The Prestige (film)\n",
      "Dunkirk (2017 film)\n",
      "Following\n",
      "Interstellar (film)\n",
      "Tenet (film)\n",
      "The Dark Knight\n",
      "The Dark Knight Rises\n",
      "Doodlebug (film)\n",
      "Inception\n",
      "Insomnia (2002 film)\n",
      "Oppenheimer (film)\n"
     ]
    }
   ],
   "source": [
    "sparql_endpoint = \"http://dbpedia.org/sparql\"\n",
    "get_movies_directors_in(sparql_endpoint, \"Christopher Nolan\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX dbo: <http://dbpedia.org/ontology/>\\nPREFIX dct: <http://purl.org/dc/terms/>\\n\\nSELECT ?movie ?title (COUNT(DISTINCT ?genre) as ?genreCount)\\nWHERE {\\n  ?movie rdf:type dbo:Film;\\n         rdfs:label ?title.\\n\\n  OPTIONAL {\\n    ?movie dct:subject ?subject.\\n    ?subject rdfs:label ?subjectText.\\n  }\\n\\n  BIND(\\n    IF(\\n      CONTAINS(UCASE(?subjectText), \"COMEDY\"), \"COMEDY\",\\n      IF(\\n        CONTAINS(UCASE(?subjectText), \"DRAMA\"), \"DRAMA\",\\n        IF(\\n          CONTAINS(UCASE(?subjectText), \"HORROR\"), \"HORROR\",\\n          IF(CONTAINS(UCASE(?subjectText), \"ROMANTIC\"), \"ROMANTIC\", \"\")\\n        )\\n      )\\n    ) as ?genre\\n  )\\n\\n  FILTER(?genre != \"\")\\n\\n  FILTER(LANG(?title)=\"en\")\\n}\\nGROUP BY ?movie ?title\\nLIMIT 100\\n'"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# for genre\n",
    "\"\"\"PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "\n",
    "SELECT ?movie ?title ?subjectText\n",
    "WHERE {\n",
    "  ?movie rdf:type dbo:Film;\n",
    "         rdfs:label ?title.\n",
    "\n",
    "  OPTIONAL {\n",
    "    ?movie dct:subject ?subject.\n",
    "?subject rdfs:label ?subjectText.\n",
    "  }\n",
    "\n",
    "  FILTER(\n",
    "    CONTAINS(UCASE(?subjectText), \"COMEDY\") ||\n",
    "    CONTAINS(UCASE(?subjectText), \"DRAMA\") ||\n",
    "    CONTAINS(UCASE(?subjectText), \"HORROR\") ||\n",
    "    CONTAINS(UCASE(?subjectText), \"ROMANTIC\")\n",
    "  )\n",
    "\n",
    "\n",
    "\n",
    "  FILTER(LANG(?title)=\"en\")\n",
    "}\n",
    "LIMIT 100\"\"\"\n",
    "\n",
    "\n",
    "#genre count\n",
    "\"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "\n",
    "SELECT ?movie ?title (COUNT(DISTINCT ?genre) as ?genreCount)\n",
    "WHERE {\n",
    "  ?movie rdf:type dbo:Film;\n",
    "         rdfs:label ?title.\n",
    "\n",
    "  OPTIONAL {\n",
    "    ?movie dct:subject ?subject.\n",
    "    ?subject rdfs:label ?subjectText.\n",
    "  }\n",
    "\n",
    "  BIND(\n",
    "    IF(\n",
    "      CONTAINS(UCASE(?subjectText), \"COMEDY\"), \"COMEDY\",\n",
    "      IF(\n",
    "        CONTAINS(UCASE(?subjectText), \"DRAMA\"), \"DRAMA\",\n",
    "        IF(\n",
    "          CONTAINS(UCASE(?subjectText), \"HORROR\"), \"HORROR\",\n",
    "          IF(CONTAINS(UCASE(?subjectText), \"ROMANTIC\"), \"ROMANTIC\", \"\")\n",
    "        )\n",
    "      )\n",
    "    ) as ?genre\n",
    "  )\n",
    "\n",
    "  FILTER(?genre != \"\")\n",
    "\n",
    "  FILTER(LANG(?title)=\"en\")\n",
    "}\n",
    "GROUP BY ?movie ?title\n",
    "LIMIT 100\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#count variables if made by same director\n",
    "\"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "\n",
    "SELECT ?movie ?title \n",
    "       (COUNT(DISTINCT ?genre) as ?genreCount)\n",
    "       (COUNT(DISTINCT ?favActor) as ?actorCount)\n",
    "       (MAX(?isFavoriteDirector) as ?isFavoriteDirector)\n",
    "WHERE {\n",
    "  ?movie rdf:type dbo:Film;\n",
    "         rdfs:label ?title.\n",
    "\n",
    "  OPTIONAL {\n",
    "    ?movie dct:subject ?subject.\n",
    "    ?subject rdfs:label ?subjectText.\n",
    "  }\n",
    "\n",
    "  BIND(\n",
    "    IF(\n",
    "      CONTAINS(UCASE(?subjectText), \"COMEDY\"), \"COMEDY\",\n",
    "      IF(\n",
    "        CONTAINS(UCASE(?subjectText), \"DRAMA\"), \"DRAMA\",\n",
    "        IF(\n",
    "          CONTAINS(UCASE(?subjectText), \"HORROR\"), \"HORROR\",\n",
    "          IF(CONTAINS(UCASE(?subjectText), \"ROMANTIC\"), \"ROMANTIC\", \"\")\n",
    "        )\n",
    "      )\n",
    "    ) as ?genre\n",
    "  )\n",
    "\n",
    "  OPTIONAL {\n",
    "    ?movie dbo:starring ?actorResource.\n",
    "    ?actorResource rdfs:label ?favActor.\n",
    "  }\n",
    "\n",
    "  OPTIONAL {\n",
    "    ?movie dbo:director ?directorResource.\n",
    "    ?directorResource rdfs:label ?director.\n",
    "  }\n",
    "\n",
    "  BIND(\n",
    "    IF(CONTAINS(UCASE(?favActor), \"FAVORITE_ACTOR\"), \"FAVORITE_ACTOR\", \"\") as ?actor\n",
    "  )\n",
    "\n",
    "  BIND(\n",
    "    IF(CONTAINS(UCASE(?director), \"FAVORITE_DIRECTOR\"), 1, 0) as ?isFavoriteDirector\n",
    "  )\n",
    "\n",
    "  FILTER(?genre != \"\" || ?actor != \"\")\n",
    "\n",
    "  FILTER(LANG(?title)=\"en\")\n",
    "}\n",
    "GROUP BY ?movie ?title\n",
    "LIMIT 10\n",
    "\"\"\""
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "datamining",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
